---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MatchlineTopOffset
source: html/d3d1e7e6-4ce0-0621-066d-534e5235d7c9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MatchlineTopOffset Property

"Top Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId MatchlineTopOffset { get; }
```